Terraform plan in __terraform/awsk3s01__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.k3s.data.cloudinit_config.agent_user_data will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "agent_user_data"  {
      - base64_encode = true -> null
      - boundary      = "MIMEBOUNDARY" -> null
      - gzip          = true -> null
      ~ id            = "**********" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/2SQXWvyQBCF7xfyH+b1Be/GbVFqSfGiarTFL/CjUiiUTbImi5vNsjuxCfTHlwoVwcsZnnMeOKPSkDSE28bKEIpKk7LCES9ULdMniMvKpMI1g9bidRENV7vl+Hn93mK/F75J51VpQrjv3AUsYIjXUMAu3U4Yf5AOI5OUqTJZCP1Y0RVwlpOsidfoc6m1T5yyFLCFKuSN5/8/HivDY+FzllROA/rDHHIi60POM0mdY9d3VAnfMOtuPrerWbQc9Fduko4fi+PmZS820XCyP9nRaTo9I7v1fPCXDx96vS74HBCYsISZJKhsKkhCuw0fl58ynoTWIL58ohVgc7MAYsB+AgAA//9bhDXCYAEAAA==" -> (known after apply)

      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # module.k3s.aws_instance.k3s_instance will be updated in-place
  ~ resource "aws_instance" "k3s_instance" {
        id                                   = "i-03091eab6c94f53b8"
      ~ instance_type                        = "t3.micro" -> "t3.small"
        tags                                 = {}
        # (28 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # module.k3s.aws_launch_template.agent_launch_template will be updated in-place
  ~ resource "aws_launch_template" "agent_launch_template" {
        id                      = "lt-0b1e93e102c65ac72"
      ~ image_id                = "************************************************"
      ~ instance_type           = "t3.micro" -> "t3.small"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "awsk3s01-agent"
        tags                    = {}
      ~ user_data               = "H4sIAAAAAAAA/2SQXWvyQBCF7xfyH+b1Be/GbVFqSfGiarTFL/CjUiiUTbImi5vNsjuxCfTHlwoVwcsZnnMeOKPSkDSE28bKEIpKk7LCES9ULdMniMvKpMI1g9bidRENV7vl+Hn93mK/F75J51VpQrjv3AUsYIjXUMAu3U4Yf5AOI5OUqTJZCP1Y0RVwlpOsidfoc6m1T5yyFLCFKuSN5/8/HivDY+FzllROA/rDHHIi60POM0mdY9d3VAnfMOtuPrerWbQc9Fduko4fi+PmZS820XCyP9nRaTo9I7v1fPCXDx96vS74HBCYsISZJKhsKkhCuw0fl58ynoTWIL58ohVgc7MAYsB+AgAA//9bhDXCYAEAAA==" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Warning: Provider aws is undefined

  on main.tf line 104, in module "k3s":
 104:     aws = aws

Module module.k3s does not declare a provider named aws.
If you wish to specify a provider configuration for the module, add an entry
for aws in the required_providers block within the module.
```
</details>

:white_check_mark: Plan applied in [AWSK3S01 Trunk Apply #8](https://github.com/yardbirdsax/infra-k8slab/actions/runs/1542131600)